<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of OpenVPN Connect and creates a package.</string>
	<key>Identifier</key>
	<string>com.github.bquachlafs.pkg.OpenVPNConnect</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>OpenVPN Connect</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.dataJAR-recipes.download.OpenVPN Connect Client 3</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>FlatPkgUnpacker</string>
			<key>Arguments</key>
			<dict>
				<key>flat_pkg_path</key>
                <string>%pathname%/OpenVPN*.pkg</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/unpack</string>
            </dict>
		</dict>
		<dict>
            <key>Processor</key>
            <string>PkgPayloadUnpacker</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_payload_path</key>
                <string>%RECIPE_CACHE_DIR%/unpack/tmp-app.pkg/Payload</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/pkgroot/Applications/OpenVPN Connect/OpenVPN Connect.app</string>
                <key>purge_destination</key>
                <true/>
            </dict>
        </dict>
		<dict>
            <key>Processor</key>
            <string>PlistReader</string>
            <key>Arguments</key>
            <dict>
                <key>info_path</key>
                <string>%RECIPE_CACHE_DIR%/pkgroot/Applications/OpenVPN Connect/OpenVPN Connect.app/Contents/Info.plist</string>
                <key>plist_keys</key>
                <dict>
                    <key>CFBundleShortVersionString</key>
                    <string>version</string>
                </dict>
            </dict>
        </dict>
		<dict>
			<key>Processor</key>
				<string>PkgCopier</string>
			<key>Arguments</key>
				<dict>
					<key>source_pkg</key>
					<string>%RECIPE_CACHE_DIR%/unpack</string>
					<key>pkg_path</key>
					<string>%RECIPE_CACHE_DIR%/OpenVPNConnect-%version%.pkg</string>
				</dict>
		</dict>
		<dict>
            <key>Processor</key>
            <string>PathDeleter</string>
            <key>Arguments</key>
            <dict>
                <key>path_list</key>
                <array>
                    <string>%RECIPE_CACHE_DIR%/pkgroot/</string>  
                    <string>%RECIPE_CACHE_DIR%/unpack/</string>                      
                </array>
            </dict>
        </dict>
	</array>
</dict>
</plist>
